##  plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.id will be created
+   resource "random_id" "id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 12
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id = (known after apply)
```